package org.example.Lesson8HomeWork;

// TODO:
//TODO 1. В первом классе создайте 2 static метода. 1-й пусть умножает 3 числа из параметра метода и возвращает
// их произведение. 2-ой делит первое счисло из параметра на второе и  ничег не возвращает, лишь выводит на дисплей в
// читабельном виде целое частное и остаток.
// ВО втором классе  по два раза используйте данные методы.
// 2.В первом классе создайте static final переменную Пи = 3б14. Используйте данную константу в non-static методе,
// который принимает в параметре значение радиуса и вычисляет площадь круга по формуле:
// Площадь = Пи * радиус * радиус. Также используйте данную константу в static методе, который принимает в параметре
// значение радиуса и вычисляет длину окружности по формуле:
// S = 2 * pi * r. Создайте еще один non-static метод, который принимает в парамете значение радиуса и выводит на экран
// информацию о радиусе, площади и круге и длине окружности. Используйте все 3 метода во 3-м классе.

public class HomeWork {
}
